cadastro/app/Controllers/AlunoController.php

INSERT INTO `alunos` (`nome`, `nascimento`, `endereco`, `cidade`) VALUES ('jessica', '2021-12-01', 'Rua principal do arraial 321', 'Araçuai')
---
    public function index()
    {
        // Se o formulário for submetido
        if ($this->request->getMethod() === 'post') {
            // Carregue o modelo
            $alunoModel = new AlunoModel();

            // Obtenha os dados do formulário
            $data = [
                'nome'      => $this->request->getPost('nome'),
                'nascimento' => $this->request->getPost('nascimento'),
                'endereco'  => $this->request->getPost('endereco'),
                'cidade'    => $this->request->getPost('cidade'),
            ];

            // Insira os dados no banco de dados
            $alunoModel->insert($data);

SELECT *
FROM `alunos`
---
    public function consulta()
    {
        $alunoModel = new AlunoModel();

        // Busca todos os alunos
        $alunos = $alunoModel->findAll();